[
    {
        "courseCode": "CISC 497",
        "faculty": "Computing",
        "name": "Social Ethical & Legal Issues",
        "description": "A wide range of topics of current importance in computing, including technical issues, professional questions, and moral and ethical decisions. Students make presentations, deliver papers, and engage in discussion.",
        "year": 4,
        "semester": 2
    },
    {
        "courseCode": "CISC 458",
        "faculty": "Computing",
        "name": "Program Language Processors",
        "description": "Introduction to the systematic construction of a compiler: grammars and languages, scanners, top-down and bottom-up parsing, runtime organization, symbol tables, internal representations; Polish notation, syntax trees, semantic routines, storage allocation, code generation, interpreters.",
        "year": 4,
        "semester": 2
    },
    {
        "courseCode": "CISC 423",
        "faculty": "Computing",
        "name": "Software Requirements",
        "description": "An integrated approach to discovering and documenting software requirements. Identification of stakeholders; customer, operator, analyst, and developer perspectives. Requirements elicitation. Transition from initial (informal) requirements to semi-formal and formal representations. Requirements analysis process; analysis patterns. Requirements specification techniques. Relation to architecture and user interface design; traceability of requirements.",
        "year": 4,
        "semester": 2
    },
    {
        "courseCode": "CISC 332",
        "faculty": "Computing",
        "name": "Database Management Systems",
        "description": "Data models: relational, entity-relationship. Relational query languages: relational algebra and SQL. Relational database design. Application interfaces and embedded SQL. Storage and indexing.",
        "year": 4,
        "semester": 2
    },
    {
        "courseCode": "CISC 282",
        "faculty": "Computing",
        "name": "Fund. Web Development",
        "description": "This course surveys current best practices for implementing attractive, usable, secure and maintainable web applications. Other issues considered include: accessibility, platform and browser independence, licensing of intellectual property, scalability, user privacy, and using web technologies in mobile development.",
        "year": 4,
        "semester": 2
    },
    {
        "courseCode": "FILM 225",
        "faculty": "Film and Media",
        "name": "The Comedy Film",
        "description": "This course examines the emergence and continuing popularity of the comedy film from a global perspective. It explores the history and transformations of the genre and the ways in which comedy has been mobilized as a popular media to address larger cultural, political, and sociological issues.",
        "year": 4,
        "semester": 1
    },
    {
        "courseCode": "CLST 205",
        "faculty": "Classical Studies",
        "name": "Ancient Humour",
        "description": "The techniques by which humour was created in literature and the visual arts in antiquity; social and psychological aspects of humour.",
        "year": 4,
        "semester": 1
    },
    {
        "courseCode": "CISC 453",
        "faculty": "Computing",
        "name": "Topics in Artificial Intell.",
        "description": "Investigation of selected areas of artificial intelligence research. Possible topics include natural language understanding, computational perception, planning, learning, and neurocomputing.",
        "year": 4,
        "semester": 1
    },
    {
        "courseCode": "CISC 452",
        "faculty": "Computing",
        "name": "Neural and Genetic Computing",
        "description": "Introduction to neural and genetic computing. Topics include associative memory systems, neural optimization strategies, supervised and unsupervised classification networks, genetic algorithms, genetic and evolutionary programming. Applications are examined, and the relation to biologic systems is discussed.",
        "year": 4,
        "semester": 1
    },
    {
        "courseCode": "CISC 422",
        "faculty": "Computing",
        "name": "Formal Methods in Software Eng",
        "description": "Mathematical methods for describing software behaviour and structure. Topics include (but are not limited to) the following: Requirements specification. Module specification: axiomatic, algebraic, and trace specifications. Abstract models. Verification. Specification-based validation.",
        "year": 4,
        "semester": 1
    },
    {
        "courseCode": "HIST 200",
        "faculty": "History",
        "name": "India and the World",
        "description": "This course examines the history of India as a series of contacts with the rest of the world. Topics include Roman trade in ancient India, the Portuguese, Turkish, and Mughal empires, Gandhi in South Africa, and South Asian diasporas in Europe and North America. Course materials include histories, travel accounts, court chronicles, medical treatises, literature, and film.",
        "year": 3,
        "semester": 2
    },
    {
        "courseCode": "CISC 365",
        "faculty": "Computing",
        "name": "Algorithms I",
        "description": "Principles of design, analysis and implementation of efficient algorithms. Case studies from a variety of areas illustrate divide and conquer methods, the greedy approach, branch and bound algorithms and dynamic programming.",
        "year": 3,
        "semester": 2
    },
    {
        "courseCode": "CISC 352",
        "faculty": "Computing",
        "name": "Artificial Intelligence",
        "description": "An introduction to the basic principles and tools of artificial intelligence. Problem solving methods and knowledge representation techniques.",
        "year": 3,
        "semester": 2
    },
    {
        "courseCode": "CISC 325",
        "faculty": "Computing",
        "name": "Human-Computer Interaction",
        "description": "Developing usable software requires that human factors be considered throughout the design and development process. This course introduces a series of techniques for development and evaluating usable software, and shows how these techniques can be integrated into a process for software development.",
        "year": 3,
        "semester": 2
    },
    {
        "courseCode": "CISC 324",
        "faculty": "Computing",
        "name": "Operating Systems",
        "description": "Layered operating systems for conventional shared memory computers: concurrent processes. Synchronization and communication. Concurrent algorithms. Scheduling. Deadlock. Memory management. Protection. File systems. Device management. Typical layers.",
        "year": 3,
        "semester": 2
    },
    {
        "courseCode": "STAT 263",
        "faculty": "Statistics",
        "name": "Introduction to Statistics",
        "description": "A basic course in statistical methods with the necessary probability included. Topics include probability models, random variables, distributions, estimation, hypothesis testing, elementary nonparametric methods.",
        "year": 3,
        "semester": 1
    },
    {
        "courseCode": "COMM 200",
        "faculty": "Commerce",
        "name": "Business Fundamentals",
        "description": "This course will develop an appreciation of the role of the manager and business in society. It will discuss Canadian and global trends and issues - political, economic, technological, and ethical - that affect business and management. The course will introduce the student to the nature of the modern corporate enterprise, large and small, and begin the building of business analysis skills.",
        "year": 3,
        "semester": 1
    },
    {
        "courseCode": "CLST 102",
        "faculty": "Classical Studies",
        "name": "Intro to Greek Civilization",
        "description": "An introduction to major themes in the development of Greek civilization using the evidence of literature, history and archaeology. Some attention will be given to those aspects of ancient cultural and intellectual growth that are of significance in the western tradition.",
        "year": 3,
        "semester": 1
    },
        {
        "courseCode": "CISC 327",
        "faculty": "Computing",
        "name": "Software Quality Assurance",
        "description": "Validation of software throughout the life cycle. Comparative effectiveness in defect removal of formal methods (proofs of correctness), inspection (walkthroughs and reviews), and testing (unit, integration, and system testing; white box versus black box).",
        "year": 3,
        "semester": 1
    },
        {
        "courseCode": "CISC 326",
        "faculty": "Computing",
        "name": "Game Architecture",
        "description": "An introduction to software architectural design through the application domain of game development. Abstractions and patterns of interactions and relationships among modules. Design recovery. Relationship to requirements and testing.",
        "year": 3,
        "semester": 1
    },
    {
        "courseCode": "CISC 271",
        "faculty": "Computing",
        "name": "Scientific Computing",
        "description": "Elements of linear algebra for data analysis, including: solution of linear equations; vector spaces; matrix decompositions; principal components analysis; linear regression; hyperplane classification of vectorial data.",
        "year": 2,
        "semester": 2
    },
    {
        "courseCode": "CISC 260",
        "faculty": "Computing",
        "name": "Programming Paradigms",
        "description": "Review of imperatives programming features. Introduction to other widely used programming paradigms. Functional programming languages, such as LISP and Haskell. Higher order functions, lazy evaluation, abstract and recursive types, structural induction, symbolic expressions. Logic programming languages, such as PROLOG. Operational interpretation of predicates and terms, proof search, unification, backtracking. Typical applications.",
        "year": 2,
        "semester": 2
    },
    {
        "courseCode": "CISC 235",
        "faculty": "Computing",
        "name": "Data Structures",
        "description": "Design and implementation of advanced data structures and related algorithms, including correctness and complexity analysis.",
        "year": 2,
        "semester": 2
    },
    {
        "courseCode": "CISC 223",
        "faculty": "Computing",
        "name": "Software Specifications",
        "description": "Introduction to techniques for specifying the behaviour of software, with applications of these techniques to design, verification and construction of software. Logic-based techniques such as loop invariants and class invariants. Automata and grammar-based techniques, with applications to scanners, parsers, user-interface dialogs and embedded systems. Computability issues in software specifications.",
        "year": 2,
        "semester": 2
    },
    {
        "courseCode": "CISC 221",
        "faculty": "Computing",
        "name": "Computer Architecture",
        "description": "The descriptive levels of computer architecture. Instruction-set architectures. Assembly Language. Data representation. Support for operating-system management and high-level languages. Input/output and interrupts. Designing for performance. Digital Logic.",
        "year": 2,
        "semester": 2
    },
    {
        "courseCode": "WRIT 125",
        "faculty": "Writing",
        "name": "Academic Essay Writing",
        "description": "A study of the basic principles of academic writing, including a series of assignments that emphasize logical organization, stylistic clarity, and grammatical precision.",
        "year": 2,
        "semester": 1
    },
    {
        "courseCode": "CISC 220",
        "faculty": "Computing",
        "name": "System Level Programming",
        "description": "Basic concepts of Unix-like systems. Shells and scripting. System-level programming in the C language. Software development tools and techniques.",
        "year": 2,
        "semester": 1
    },
    {
        "courseCode": "CISC 204",
        "faculty": "Computing",
        "name": "Logic for Computing Science",
        "description": "Elements of mathematical logic with computing applications. Formal proof systems for propositional and predicate logic. Interpretations, validity, and satisfiability. Introduction to soundness, completeness and decidability.",
        "year": 2,
        "semester": 1
    },
    {
        "courseCode": "CISC 203",
        "faculty": "Computing",
        "name": "Discrete Math For Computing II",
        "description": "Proof methods. Combinatorics: permutations and combinations, discrete probability, recurrence relations. Graphs and trees. Boolean and abstract algebra.",
        "year": 2,
        "semester": 1
    },
    {
        "courseCode": "CISC 124",
        "faculty": "Computing",
        "name": "Intro. to Computing Science II",
        "description": "Introduction to object-oriented design, architecture, and programming. Use of packages, class libraries, and interfaces. Encapsulation and representational abstraction. Inheritance. Polymorphic programming. Exception handling. Iterators. Introduction to a class design notation. Numerical computation. Applications in various areas.",
        "year": 2,
        "semester": 1
    },
    {
        "courseCode": "MUSC 102",
        "faculty": "Music",
        "name": "Music Napoleon to 9/11",
        "description": "The history of Western art music from 1750 to the present. The course focuses on musical styles, genres, and composers, as well as historical and social contextual considerations.",
        "year": 1,
        "semester": 2
    },
    {
        "courseCode": "MATH 121B",
        "faculty": "Mathematics",
        "name": "Diff & Integral Calculus",
        "description": "A thorough discussion of calculus, including limits, continuity, differentiation, integration, multivariable differential calculus, and sequences and series.",
        "year": 1,
        "semester": 2
    },
    {
        "courseCode": "MATH 112",
        "faculty": "Mathematics",
        "name": "Introduction to Linear Algebra",
        "description": "A brief introduction to matrix algebra, linear algebra, and applications. Topics include systems of linear equations, matrix algebra, determinants, the vector spaces Rn and their subspaces, bases, co-ordinates, orthogonalization, linear transformations, eigenvectors, diagonalization of symmetric matrices, quadratic forms.",
        "year": 1,
        "semester": 2
    },
    {
        "courseCode": "FILM 110B",
        "faculty": "Film and Media",
        "name": "Film, Culture & Communication",
        "description": "Introduction to analysis of film, television, new media and other related forms of contemporary culture. Includes classical and contemporary Hollywood cinema, Canadian film and television, and alternatives in international cinema. Course requirements include both written work and elementary projects on videotape.",
        "year": 1,
        "semester": 2
    },
    {
        "courseCode": "CISC 121",
        "faculty": "Computing",
        "name": "Intro. to Computing Science I",
        "description": "Introduction to design, analysis, and implementation of algorithms. Recursion, backtracking, and exits. Sequences. Elementary searching and sorting. Order-of-magnitude complexity. Documentation, iterative program development, translating natural language to code, testing and debugging.",
        "year": 1,
        "semester": 2
    },
    {
        "courseCode": "MATH 121A",
        "faculty": "Mathematics",
        "name": "Diff & Integral Calculus",
        "description": "A thorough discussion of calculus, including limits, continuity, differentiation, integration, multivariable differential calculus, and sequences and series.",
        "year": 1,
        "semester": 1
    },
    {
        "courseCode": "GEOL 106",
        "faculty": "Geology",
        "name": "Enviro Geol & Natural Hazards",
        "description": "The relationship between human-kind and our ever-changing planet, with a focus on natural geologic hazards (volcanic eruptions, earthquakes, landslides, tsunamis, mass movement, floods, extraterrestrial impacts, etc.), and environmental impacts which result from population and land-use expansion and our increased use of water, energy and mineral resources. A study of the sources and impact of pollution and global climate change. Public perception of and response to geological risk.",
        "year": 1,
        "semester": 1
    },
    {
        "courseCode": "FILM 110A",
        "faculty": "Film and Media",
        "name": "Film, Culture & Communication",
        "description": "Introduction to analysis of film, television, new media and other related forms of contemporary culture. Includes classical and contemporary Hollywood cinema, Canadian film and television, and alternatives in international cinema. Course requirements include both written work and elementary projects on videotape.",
        "year": 1,
        "semester": 1
    },
    {
        "courseCode": "CISC 102",
        "faculty": "Computing",
        "name": "Discrete Math for Computing l ",
        "description": "Introduction to mathematical discourse and proof methods. Sets, functions, sequences, and relations. Properties of the integers. Induction. Equivalence relations. Linear and partial orderings.",
        "year": 1,
        "semester": 1
    },
    {
        "courseCode": "CISC 101",
        "faculty": "Computing",
        "name": "Elements of Comp. Sc.",
        "description": "Introduction to algorithms: their definition, design, coding, and execution on computers. Intended for students who have no programming experience. All or most assignment work will be completed during lab time.",
        "year": 1,
        "semester": 1
    }
]